---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTray.GetShapeType
zh: 桥架、线槽
source: html/d1d72c10-2a66-9b10-b0c2-87b47858bae1.htm
---
# Autodesk.Revit.DB.Electrical.CableTray.GetShapeType Method

**中文**: 桥架、线槽

Returns the shape type for the cable tray.

## Syntax (C#)
```csharp
public CableTrayShape GetShapeType()
```

## Returns
The shape type.